{"config": [{"class_name": "Cropping2D", "config": {"cropping": [[60, 20], [0, 0]], "name": "cropping2d_1", "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "trainable": true}}, {"class_name": "Lambda", "config": {"function_type": "lambda", "batch_input_shape": [null, 140, 260, 3], "trainable": true, "arguments": {}, "name": "lambda_1", "input_dtype": "float32", "output_shape": null, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\fcar_train.py\u00da\b<lambda>\u00d4\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_constraint": null, "nb_filter": 24, "trainable": true, "nb_col": 5, "activity_regularizer": null, "nb_row": 5, "init": "glorot_uniform", "b_regularizer": null, "activation": "elu", "border_mode": "valid", "name": "convolution2d_1", "W_constraint": null, "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_constraint": null, "nb_filter": 36, "trainable": true, "nb_col": 5, "activity_regularizer": null, "nb_row": 5, "init": "glorot_uniform", "b_regularizer": null, "activation": "elu", "border_mode": "valid", "name": "convolution2d_2", "W_constraint": null, "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_constraint": null, "nb_filter": 48, "trainable": true, "nb_col": 5, "activity_regularizer": null, "nb_row": 5, "init": "glorot_uniform", "b_regularizer": null, "activation": "elu", "border_mode": "valid", "name": "convolution2d_3", "W_constraint": null, "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_constraint": null, "nb_filter": 64, "trainable": true, "nb_col": 3, "activity_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "b_regularizer": null, "activation": "elu", "border_mode": "valid", "name": "convolution2d_4", "W_constraint": null, "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_constraint": null, "nb_filter": 64, "trainable": true, "nb_col": 3, "activity_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "b_regularizer": null, "activation": "elu", "border_mode": "valid", "name": "convolution2d_5", "W_constraint": null, "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "trainable": true, "name": "maxpooling2d_1", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "trainable": true, "output_dim": 100, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "activation": "elu", "name": "dense_1", "W_constraint": null, "bias": true, "W_regularizer": null, "input_dim": 1024}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.8, "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "trainable": true, "output_dim": 50, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "activation": "elu", "name": "dense_2", "W_constraint": null, "bias": true, "W_regularizer": null, "input_dim": 100}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.8, "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "trainable": true, "output_dim": 10, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "activation": "elu", "name": "dense_3", "W_constraint": null, "bias": true, "W_regularizer": null, "input_dim": 50}}, {"class_name": "Dense", "config": {"b_constraint": null, "trainable": true, "output_dim": 1, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "activation": "linear", "name": "dense_4", "W_constraint": null, "bias": true, "W_regularizer": null, "input_dim": 10}}], "keras_version": "1.2.1", "class_name": "Sequential"}